var _____WB$wombat$assign$function_____ = function(name) {return (self._wb_wombat && self._wb_wombat.local_init && self._wb_wombat.local_init(name)) || self[name]; };
if (!self.__WB_pmw) { self.__WB_pmw = function(obj) { this.__WB_source = obj; return this; } }
{
  let window = _____WB$wombat$assign$function_____("window");
  let self = _____WB$wombat$assign$function_____("self");
  let document = _____WB$wombat$assign$function_____("document");
  let location = _____WB$wombat$assign$function_____("location");
  let top = _____WB$wombat$assign$function_____("top");
  let parent = _____WB$wombat$assign$function_____("parent");
  let frames = _____WB$wombat$assign$function_____("frames");
  let opener = _____WB$wombat$assign$function_____("opener");

EQUIP_INFO.magspk = {
  //イベント
  "41F6":"ジャストミートⅠ,525,0,,4,20,,9,,3,,2200,1e,T,巧流強化,こんがり肉を象った磁斬鎚。「いい匂いニャ！」≪辿異武器≫,D0C350"
  ,"41F7":"ジャストミートⅡ,540,0,,4,40,,10,,3,,2400,1e,T,巧流強化,こんがり肉を象った磁斬鎚。「スタミナ満タンだニャ！」≪辿異武器≫,D0C350"
  ,"41F8":"ジャストミートⅢ,555,0,,4,60,,11,,3,,2600,1e,T,巧流強化,こんがり肉を象った磁斬鎚。「これでも喰らえ、ニャ！」≪辿異武器≫,D0C350"
  ,"41F9":"ジャストミートニャ！,570,0,,4,80,,12,,3,,2800,1e,T,巧流強化,こんがり肉を象った磁斬鎚。「もうお腹いっぱいニャ……」≪辿異武器≫,D0C350"
  ,"4339":"グラハムスパイクⅠ,435,17,40,0,,,11,5,,,2001,1e,K,,マグネットスパイクのレジェントラストを模した磁斬鎚。,D0D350"
  ,"433A":"グラハムスパイクⅡ,525,17,80,0,,,9,,3,,2200,1e,T,属撃強化,マグネットスパイクのレジェントラストを模した磁斬鎚。≪辿異武器≫,D0D350"
  ,"433B":"グラハムスパイクⅢ,540,17,100,0,,,10,,3,,2400,1e,T,属撃強化,マグネットスパイクのレジェントラストを模した磁斬鎚。≪辿異武器≫,D0D350"
  ,"433C":"グラハムスパイクⅣ,555,17,120,0,,,11,,3,,2600,1e,T,属撃強化,マグネットスパイクのレジェントラストを模した磁斬鎚。≪辿異武器≫,D0D350"
  ,"433D":"グラハムスパイクⅤ,570,17,140,0,,,12,,3,,2800,1e,T,属撃強化,マグネットスパイクのレジェントラストを模した磁斬鎚。≪辿異武器≫,D0D350"
  ,"42F7":"賀正斬鎚【日出】,508,9,44,0,,,9,,3,,2200,1e,T,スキル枠拡張+1,新年を煌びやかに祝う、験を担ぎに担いだ磁斬鎚。謹賀新年。≪辿異武器≫,D0E300"
  ,"42F8":"賀正斬鎚【日光】,523,9,66,0,,,10,,3,,2400,1e,T,スキル枠拡張+1,新年を煌びやかに祝う、験を担ぎに担いだ磁斬鎚。謹賀新年。≪辿異武器≫,D0E300"
  ,"42F9":"賀正斬鎚【天晴】,538,9,88,0,,,11,,3,,2600,1e,T,スキル枠拡張+1,新年を煌びやかに祝う、験を担ぎに担いだ磁斬鎚。謹賀新年。≪辿異武器≫,D0E300"
  ,"42FA":"賀正斬鎚【天照】,553,9,120,0,,,12,,3,,2800,1e,T,スキル枠拡張+1,新年を煌びやかに祝う、験を担ぎに担いだ磁斬鎚。謹賀新年。≪辿異武器≫,D0E350"
  ,"4498":"ヴォルノボリんⅠ,519,2,105,0,,,9,,3,,2200,1e,T,幕無強化,鯉の形をした磁斬鎚。桜が散り暫く経つと空に掲げる風習があるとか。≪辿異武器≫,D0D350"
  ,"4499":"ヴォルノボリんⅡ,534,2,120,0,,,10,,3,,2400,1e,T,幕無強化,鯉の形をした磁斬鎚。桜が散り暫く経つと空に掲げる風習があるとか。≪辿異武器≫,D0D350"
  ,"449A":"ヴォルノボリんⅢ,549,2,135,0,,,11,,3,,2600,1e,T,幕無強化,鯉の形をした磁斬鎚。桜が散り暫く経つと空に掲げる風習があるとか。≪辿異武器≫,D0D350"
  ,"449B":"ヴォルノボリんⅣ,564,2,150,0,,,12,,3,,2800,1e,T,幕無強化,鯉の形をした磁斬鎚。桜が散り暫く経つと空に掲げる風習があるとか。≪辿異武器≫,D0D350"
  //祈歌武器
  ,"4386":"歌繋ノ斬槌【独奏】,450,17,65,,,,11,1,,,2001,1r,S,,歌姫の力に共鳴すると、真の力が目覚める。≪祈歌武器≫,D13350"
  //G級武器
  ,"424F":"試作型磁斬槌ーα,450,0,,0,,,11,5,,,2001,,K,,西方に伝わる技術を用いて創られた最初の磁斬鎚。磁力を操る新たな力。,D00300"
  //進化武器
  ,"421D":"大蛇ノ斬鎚,150,4,20,0,,,2,,,,17,,F,0,常に進化し続けると言われる大巌竜の力を秘めた磁斬鎚。≪進化武器≫,D15150"
  ,"421E":"大蛇ノ斬鎚【燦然】,210,4,22,0,,,6,,,,17,,F,1,大巌竜に秘められた力は限界を知らず、その力は紋章の輝きに比例する。≪進化武器≫,D15350"
  ,"421F":"大蛇ノ斬鎚【絢爛】,170,4,64,0,,,4,,,,17,,F,2,大巌竜の素材を存分に活用し、龍を駆逐する力に特化した磁斬鎚。≪進化武器≫,D15350"
  ,"4220":"大蛇ノ斬鎚【煌然】,190,4,24,1,20,,5,,,,17,,F,3,大巌竜の力は未だ底が知れず、新たな可能性を見出した工房の傑作品。≪進化武器≫,D15350"
  ,"4221":"真大蛇ノ斬鎚【燦然】,320,4,49,0,,,11,,3,,2001,,Q,5,力だけを追い求める狩人に相応しいと言われる大巌竜の磁斬鎚。≪進化武器≫,D16350"
  ,"4222":"真大蛇ノ斬鎚【絢爛】,280,4,100,0,,,10,,3,,2001,,Q,6,全ての龍を駆逐する事だけに特化した磁斬鎚。≪進化武器≫,D16350"
  ,"4223":"真大蛇ノ斬鎚【煌然】,290,4,50,1,40,,10,,3,,2001,,Q,7,その新たな大巌竜の力は、全ての生命を内部から抉り、侵食する。≪進化武器≫,D16350"
  ,"4224":"真大蛇ノ斬鎚【玲瓏】,300,0,,0,,50,11,,3,,2001,,Q,8,地中深く眠る大巌竜の強大な力は磁斬鎚の新たな可能性を生み出した。≪進化武器≫,D16350"
  ,"4225":"極大蛇ノ斬鎚【燦然】,640,4,80,0,,,12,,3,,2800,,U,9|スキル枠拡張+1,力だけを追い求める狩人に相応しいと言われる大巌竜の磁斬鎚。≪進化武器≫,D17250"
  ,"4226":"極大蛇ノ斬鎚【絢爛】,600,4,150,0,,,12,,3,,2800,,U,10|スキル枠拡張+1,全ての龍を駆逐する事だけに特化した磁斬鎚。≪進化武器≫,D17250"
  ,"4227":"極大蛇ノ斬鎚【煌然】,620,4,100,1,50,,12,,3,,2800,,U,11|スキル枠拡張+1,その新たな大巌竜の力は、全ての生命を内部から抉り、侵食する。≪進化武器≫,D17250"
  ,"4228":"極大蛇ノ斬鎚【玲瓏】,680,0,,0,,50,12,,3,,2800,,U,12|スキル枠拡張+1,地中深く眠る大巌竜の強大な力は磁斬鎚の新たな可能性を生み出した。≪進化武器≫,D17250"
  ,"4467":"魔崇斬鎚・火,150,1,20,0,,,2,,,,2001,4g,F,4,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D15150"
  ,"4468":"魔崇斬鎚・火【燦然】,210,1,22,0,,,6,,,,2001,4g,F,1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D15350"
  ,"4469":"魔崇斬鎚・火【絢爛】,170,1,64,0,,,4,,,,2001,4g,F,2,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D15350"
  ,"446A":"魔崇斬鎚華火【燦然】,320,1,49,0,,,11,,3,,2001,4g,Q,5,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D16350"
  ,"446B":"魔崇斬鎚華火【絢爛】,280,1,100,0,,,10,,3,,2001,4g,Q,6,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D16350"
  ,"446C":"魔崇斬鎚業火【燦然】,640,1,80,0,,,12,,3,,2800,4g,U,9|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D17250"
  ,"446D":"魔崇斬鎚業火【絢爛】,600,1,150,0,,,12,,3,,2800,4g,U,10|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。火属性。≪進化武器≫,D17250"
  ,"446E":"魔崇斬鎚・水,150,2,20,0,,,2,,,,2001,4g,F,4,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D15150"
  ,"446F":"魔崇斬鎚・水【燦然】,210,2,22,0,,,6,,,,2001,4g,F,1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D15350"
  ,"4470":"魔崇斬鎚・水【絢爛】,170,2,64,0,,,4,,,,2001,4g,F,2,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D15350"
  ,"4471":"魔崇斬鎚帝水【燦然】,320,2,49,0,,,11,,3,,2001,4g,Q,5,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D16350"
  ,"4472":"魔崇斬鎚帝水【絢爛】,280,2,100,0,,,10,,3,,2001,4g,Q,6,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D16350"
  ,"4473":"魔崇斬鎚神水【燦然】,640,2,80,0,,,12,,3,,2800,4g,U,9|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D17250"
  ,"4474":"魔崇斬鎚神水【絢爛】,600,2,150,0,,,12,,3,,2800,4g,U,10|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。水属性。≪進化武器≫,D17250"
  ,"4475":"魔崇斬鎚・雷,150,3,20,0,,,2,,,,2001,4g,F,4,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D15150"
  ,"4476":"魔崇斬鎚・雷【燦然】,210,3,22,0,,,6,,,,2001,4g,F,1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D15350"
  ,"4477":"魔崇斬鎚・雷【絢爛】,170,3,64,0,,,4,,,,2001,4g,F,2,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D15350"
  ,"4478":"魔崇斬鎚剛雷【燦然】,320,3,49,0,,,11,,3,,2001,4g,Q,5,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D16350"
  ,"4479":"魔崇斬鎚剛雷【絢爛】,280,3,100,0,,,10,,3,,2001,4g,Q,6,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D16350"
  ,"447A":"魔崇斬鎚咆雷【燦然】,640,3,80,0,,,12,,3,,2800,4g,U,9|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D17250"
  ,"447B":"魔崇斬鎚咆雷【絢爛】,600,3,150,0,,,12,,3,,2800,4g,U,10|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。雷属性。≪進化武器≫,D17250"
  ,"447C":"魔崇斬鎚・氷,150,5,20,0,,,2,,,,2001,4g,F,4,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D15150"
  ,"447D":"魔崇斬鎚・氷【燦然】,210,5,22,0,,,6,,,,2001,4g,F,1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D15350"
  ,"447E":"魔崇斬鎚・氷【絢爛】,170,5,64,0,,,4,,,,2001,4g,F,2,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D15350"
  ,"447F":"魔崇斬鎚天氷【燦然】,320,5,49,0,,,11,,3,,2001,4g,Q,5,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D16350"
  ,"4480":"魔崇斬鎚天氷【絢爛】,280,5,100,0,,,10,,3,,2001,4g,Q,6,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D16350"
  ,"4481":"魔崇斬鎚零氷【燦然】,640,5,80,0,,,12,,3,,2800,4g,U,9|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D17250"
  ,"4482":"魔崇斬鎚零氷【絢爛】,600,5,150,0,,,12,,3,,2800,4g,U,10|スキル枠拡張+1,心の闇を喰らい進化をするという混沌と絶望に満ちた磁斬鎚。氷属性。≪進化武器≫,D17250"
  //辿異武器
  ,"4250":"試作型磁斬鎚ーβ,525,0,,0,,,9,,3,,2200,,T,スキル枠拡張+1,αの使用データを基に改良、調整された磁斬鎚。≪辿異武器≫,D03350"
  ,"4229":"棘貫斬鎚ローゼンナデ,520,0,,1,50,,9,,3,,2200,,T,劇物強化,異常発達した棘竜の角を使用した磁斬鎚。禍々しい模様は猛毒の証。≪辿異武器≫,D04300"
  ,"422A":"棘貫斬鎚ローゼンリタ,535,0,,1,60,,10,,3,,2400,,T,劇物強化,異常発達した棘竜の角を使用した磁斬鎚。禍々しい模様は猛毒の証。≪辿異武器≫,D04300"
  ,"422B":"棘貫斬鎚ローゼンメア,550,0,,1,70,,11,,3,,2600,,T,劇物強化,異常発達した棘竜の角を使用した磁斬鎚。禍々しい模様は猛毒の証。≪辿異武器≫,D04300"
  ,"422C":"棘貫斬鎚ローゼンマグ,565,0,,1,90,,12,,3,,2800,,T,劇物強化,異常発達した棘竜の角を使用した磁斬鎚。禍々しい模様は猛毒の証。≪辿異武器≫,D04350"
  ,"422D":"ヒュージ・マグナ,485,0,,0,,25,9,,3,,2200,,T,耐震強化+1,針纏竜の素材を使用した磁斬鎚。多数の針をあしらっており取扱い注意。≪辿異武器≫,D05350"
  ,"422E":"ヒュージ・ナダル,500,0,,0,,30,10,,3,,2400,,T,耐震強化+1,針纏竜の素材を使用した磁斬鎚。多数の針をあしらっており取扱い注意。≪辿異武器≫,D05350"
  ,"422F":"ヒュージ・ドゥル,515,0,,0,,35,11,,3,,2600,,T,耐震強化+1,針纏竜の素材を使用した磁斬鎚。多数の針をあしらっており取扱い注意。≪辿異武器≫,D05350"
  ,"4230":"ヒュヒュージ・ピラー,535,0,,0,,50,12,,3,,2800,,T,耐震強化+1,針纏竜の素材を使用した磁斬鎚。多数の針をあしらっており取扱い注意。≪辿異武器≫,D05350"
  ,"4235":"マグネテュレイラ,516,5,70,0,,10,9,,3,,2200,,T,纏雷強化+1,氷獰竜の素材を使用した磁斬鎚。宝石のような輝きを持つ氷塊で敵を討つ。≪辿異武器≫,D06300"
  ,"4236":"ティアーテュレイラ,531,5,80,0,,10,10,,3,,2400,,T,纏雷強化+1,氷獰竜の素材を使用した磁斬鎚。宝石のような輝きを持つ氷塊で敵を討つ。≪辿異武器≫,D06300"
  ,"4237":"イナルステュレイラ,546,5,90,0,,10,11,,3,,2600,,T,纏雷強化+1,氷獰竜の素材を使用した磁斬鎚。宝石のような輝きを持つ氷塊で敵を討つ。≪辿異武器≫,D06300"
  ,"4238":"チリングテューレ,561,5,110,0,,10,12,,3,,2800,,T,纏雷強化+1,氷獰竜の素材を使用した磁斬鎚。宝石のような輝きを持つ氷塊で敵を討つ。≪辿異武器≫,D06350"
  ,"4231":"絶爆狼斬鎚フレンジー,510,1,44,0,,5,9,,3,,2200,,T,巧撃強化+1,更に脅威を増やした爆狼の磁斬鎚。誇り高き狼の如く敵を殲滅する。≪辿異武器≫,D07350"
  ,"4232":"絶爆狼斬鎚エタンセル,525,1,55,0,,10,10,,3,,2400,,T,巧撃強化+1,更に脅威を増やした爆狼の磁斬鎚。誇り高き狼の如く敵を殲滅する。≪辿異武器≫,D07350"
  ,"4233":"絶爆狼斬鎚シンティラ,540,1,66,0,,15,11,,3,,2600,,T,巧撃強化+1,更に脅威を増やした爆狼の磁斬鎚。誇り高き狼の如く敵を殲滅する。≪辿異武器≫,D07350"
  ,"4234":"絶爆狼斬鎚【セン】,555,1,88,0,,20,12,,3,,2800,,T,巧撃強化+1,更に脅威を増やした爆狼の磁斬鎚。誇り高き狼の如く敵を殲滅する。≪辿異武器≫,D07350"
  ,"4239":"極龍斬鎚バグリオ,495,4,60,2,8,0,9,,3,,2200,,T,耳栓強化+1,極龍の素材を使用して作られた磁斬鎚。この上ない相性が力を引きだす。≪辿異武器≫,D08350"
  ,"423A":"極龍斬鎚オウン,510,4,80,2,12,0,10,,3,,2400,,T,耳栓強化+1,極龍の素材を使用して作られた磁斬鎚。この上ない相性が力を引きだす。≪辿異武器≫,D08350"
  ,"423B":"極龍斬鎚インクリ,525,4,100,2,16,0,11,,3,,2600,,T,耳栓強化+1,極龍の素材を使用して作られた磁斬鎚。この上ない相性が力を引きだす。≪辿異武器≫,D08350"
  ,"423C":"光極龍斬鎚シィサ,550,4,120,2,20,0,12,,3,,2800,,T,耳栓強化+1,極龍の素材を使用して作られた磁斬鎚。この上ない相性が力を引きだす。≪辿異武器≫,D08350"
  ,"423D":"雅翁斬鎚シラン,522,0,,3,14,,9,,3,,2200,,T,スキル枠拡張+1,雅翁龍の力が宿る斬鎚。持ち主は捉えきれぬ緩急で敵を斬り、砕く。≪辿異武器≫,D09300"
  ,"423E":"雅翁斬鎚シャクーナ,537,0,,3,18,,10,,3,,2400,,T,スキル枠拡張+1,雅翁龍の力が宿る斬鎚。持ち主は捉えきれぬ緩急で敵を斬り、砕く。≪辿異武器≫,D09300"
  ,"423F":"雅翁斬鎚オーファン,552,0,,3,22,,11,,3,,2600,,T,スキル枠拡張+1,雅翁龍の力が宿る斬鎚。持ち主は捉えきれぬ緩急で敵を斬り、砕く。≪辿異武器≫,D09300"
  ,"4240":"雅翁斬鎚フリジオン,567,0,,3,26,,12,,3,,2800,,T,スキル枠拡張+1,雅翁龍の力が宿る斬鎚。持ち主は捉えきれぬ緩急で敵を斬り、砕く。≪辿異武器≫,D09350"
  ,"4241":"トリドワイズ,517,3,95,0,,,9,,3,,2200,,T,血気活性強化,照雷鳥の麗しさが宿る斬鎚。武器でありながらオーラを感じさせる完成度。≪辿異武器≫,D0A300"
  ,"4242":"トリドフレイズ,532,3,115,0,,,10,,3,,2400,,T,血気活性強化,照雷鳥の麗しさが宿る斬鎚。武器でありながらオーラを感じさせる完成度。≪辿異武器≫,D0A300"
  ,"4243":"トリドアリーズ,547,3,135,0,,,11,,3,,2600,,T,血気活性強化,照雷鳥の麗しさが宿る斬鎚。武器でありながらオーラを感じさせる完成度。≪辿異武器≫,D0A300"
  ,"4244":"トリド・ウジ,562,3,155,0,,,12,,3,,2800,,T,血気活性強化,照雷鳥の麗しさが宿る斬鎚。武器でありながらオーラを感じさせる完成度。≪辿異武器≫,D0A350"
  ,"4245":"ゼーゲ・カリム,506,5,105,0,,,9,,3,,2200,,T,雌伏強化,暴鋸竜の素材を用いて造られた磁斬鎚。触れれば傷を負う勢いだ。≪辿異武器≫,D0B350"
  ,"4246":"ゼーゲ・フゥール,521,5,125,0,,,10,,3,,2400,,T,雌伏強化,暴鋸竜の素材を用いて造られた磁斬鎚。触れれば傷を負う勢いだ。≪辿異武器≫,D0B350"
  ,"4247":"ゼーゲ・ダグス,536,5,145,0,,,11,,3,,2600,,T,雌伏強化,暴鋸竜の素材を用いて造られた磁斬鎚。触れれば傷を負う勢いだ。≪辿異武器≫,D0B350"
  ,"4248":"ゼーゲ・ワンデム,551,5,165,0,,,12,,3,,2800,,T,雌伏強化,暴鋸竜の素材を用いて造られた磁斬鎚。触れれば傷を負う勢いだ。≪辿異武器≫,D0B350"
  ,"4447":"多殻真斬鎚,523,3,50,0,,,9,,3,,2200,,T,猛進強化,多殻蟹の如く、強靭な造りをしている磁斬鎚。≪辿異武器≫,D11300"
  ,"4448":"多殻真斬鎚【金魚草】,538,3,60,0,,,10,,3,,2400,,T,猛進強化,多殻蟹の如く、強靭な造りをしている磁斬鎚。≪辿異武器≫,D11300"
  ,"4449":"多殻真斬鎚【立金花】,553,3,70,0,,,11,,3,,2600,,T,猛進強化,多殻蟹の如く、強靭な造りをしている磁斬鎚。≪辿異武器≫,D11300"
  ,"444A":"多殻真斬鎚【花水木】,568,3,80,0,,,12,,3,,2800,,T,猛進強化,多殻蟹の如く、強靭な造りをしている磁斬鎚。≪辿異武器≫,D11350"
  ,"4463":"司銀斬鎚シロガネ,510,0,,0,,,9,,3,,2200,,T,幕無強化,特に濃度の高い司銀龍の流体金属を用いた強度の高い磁斬鎚。≪辿異武器≫,D12350"
  ,"4464":"司銀斬鎚デルーナ,525,0,,0,,,10,,3,,2400,,T,幕無強化,特に濃度の高い司銀龍の流体金属を用いた強度の高い磁斬鎚。≪辿異武器≫,D12350"
  ,"4465":"司銀斬鎚セリノス,545,0,,0,,,11,,3,,2600,,T,幕無強化,特に濃度の高い司銀龍の流体金属を用いた強度の高い磁斬鎚。≪辿異武器≫,D12350"
  ,"4466":"司銀斬鎚エマンダロ,570,0,,0,,,12,,3,,2800,,T,幕無強化,特に濃度の高い司銀龍の流体金属を用いた強度の高い磁斬鎚。≪辿異武器≫,D12350"
  ,"420D":"クロマピラー,487,11,65,0,,,9,,3,,2200,2m,T,スキル枠拡張+1,龍を司る装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D0C350"
  ,"420E":"クロマピラー,507,11,80,0,,,10,,3,,2400,2m,T,スキル枠拡張+1,龍を司る装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D0C350"
  ,"420F":"クロマピラー,527,11,95,0,,,11,,3,,2600,2m,T,スキル枠拡張+1,龍を司る装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D0C350"
  ,"4210":"クローマピラー,552,11,125,0,,,12,,3,,2800,2m,T,スキル枠拡張+1,龍を司る装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D0C350"
  ,"43AF":"ポエトピラー,490,12,60,0,,,9,,3,,2200,2m,T,スキル枠拡張+1,神聖な装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D14350"
  ,"43B0":"ポエトピラー・改,510,12,70,0,,,10,,3,,2400,2m,T,スキル枠拡張+1,神聖な装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D14350"
  ,"43B1":"ポエトピラー・真,530,12,85,0,,,11,,3,,2600,2m,T,スキル枠拡張+1,神聖な装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D14350"
  ,"43B2":"ポエトリピラー,555,12,105,0,,,12,,3,,2800,2m,T,スキル枠拡張+1,神聖な装飾が施された磁斬鎚。儀礼用だが実用性も兼ね備えた逸品。≪辿異武器≫,D14350"
  ,"4368":"煉華ノ斬鎚,515,18,76,0,,,9,,3,,2200,2m,T,耳栓強化+1,東洋の奥地に住まう奇怪な部族の武器を基に、造られた斬鎚。≪辿異武器≫,D10350"
  ,"4369":"煉華ノ斬鎚【馬】,530,18,91,0,,,10,,3,,2400,2m,T,耳栓強化+1,東洋の奥地に住まう奇怪な部族の武器を基に、造られた斬鎚。≪辿異武器≫,D10350"
  ,"436A":"煉華ノ斬鎚【馬超】,545,18,106,0,,,11,,3,,2600,2m,T,耳栓強化+1,東洋の奥地に住まう奇怪な部族の武器を基に、造られた斬鎚。≪辿異武器≫,D10350"
  ,"436B":"煉華ノ斬鎚【越裂】,560,18,121,0,,,12,,3,,2800,2m,T,耳栓強化+1,東洋の奥地に住まう奇怪な部族の武器を基に、造られた斬鎚。≪辿異武器≫,D10350"
  //特典→キット
  ,"41FB":"ミニオ・イール,445,7,55,0,,,11,5,,,2001,4k,K,,秘められた力を、見るだけで感じ取れる、不思議な模様の磁斬鎚。,D01300"
  ,"41FC":"ミニオ・アザリー,545,7,110,0,,,11,,3,,2200,4k,T,纏雷強化+1,秘められた力を、見るだけで感じ取れる、不思議な模様の磁斬鎚。≪辿異武器≫,D01350"
  ,"4251":"ハリネ・イーラ,445,6,55,0,,,11,5,,,2001,4k,K,,用いた時の自らの勇姿が、見るだけでイメージできる磁斬鎚。,D01300"
  ,"4252":"ハリネ・イザリー,545,6,110,0,,,11,,3,,2200,4k,T,吸血強化+1,用いた時の自らの勇姿が、見るだけでイメージできる磁斬鎚。≪辿異武器≫,D01350"
  //特典→ガチャ
  ,"43F3":"マジェ・プライア,430,6,100,0,,,11,5,,,2001,4g,K,,太古より伝わる、遠国の王の伝承を元に作成された磁斬鎚。かつて世界を救ったという。,D0F300"
  ,"43F4":"マジェ・オハン,550,6,120,0,,,11,,3,,2200,4g,T,スキル枠拡張+1,太古より伝わる、遠国の王の伝承を元に作成された磁斬鎚。≪辿異武器≫,D0F350"
  ,"4435":"グレイ・プライア,430,15,85,0,,,11,5,,,2001,4g,K,,旧来より伝わる、遠国の王の伝説を元に作成された磁斬鎚。かつて世界を統べたという。,D0F300"
  ,"4436":"グレイ・リアファル,550,15,105,0,,,11,,3,,2200,4g,T,スキル枠拡張+1,旧来より伝わる、遠国の王の伝説を元に作成された磁斬鎚。≪辿異武器≫,D0F350"
  //特典→キャンペーン
  ,"424B":"パッカリグーク,445,0,,0,,10,11,5,,,2001,5-,K,,卵から生まれたてのグークを再現しようと作られた磁斬鎚。グワッ！,D02300"
  ,"424C":"パッカリグークグワ！,525,0,,0,,20,9,,3,,2200,5-,T,スキル枠拡張+1,卵から生まれたてのグークを再現しようと作られた磁斬鎚。グワッ！≪辿異武器≫,D02350"
  ,"パックリグーク":"パックリグーク,435,15,50,0,,10,11,5,,,2001,5-,K,,卵から生まれたてのグークを再現しようと作られた磁斬鎚。グワワッ！,D02300"
  ,"パックリグークグワ！":"パックリグークグワ！,510,15,100,0,,20,9,,3,,2200,5-,T,スキル枠拡張+1,卵から生まれたてのグークを再現しようと作られた磁斬鎚。グワワッ！≪辿異武器≫,D02350"
};


}
/*
     FILE ARCHIVED ON 19:42:48 Oct 09, 2019 AND RETRIEVED FROM THE
     INTERNET ARCHIVE ON 06:06:53 Nov 26, 2023.
     JAVASCRIPT APPENDED BY WAYBACK MACHINE, COPYRIGHT INTERNET ARCHIVE.

     ALL OTHER CONTENT MAY ALSO BE PROTECTED BY COPYRIGHT (17 U.S.C.
     SECTION 108(a)(3)).
*/
/*
playback timings (ms):
  captures_list: 129.542
  exclusion.robots: 0.062
  exclusion.robots.policy: 0.055
  cdx.remote: 0.045
  esindex: 0.034
  LoadShardBlock: 93.772 (3)
  PetaboxLoader3.datanode: 96.457 (5)
  load_resource: 101.235 (2)
  PetaboxLoader3.resolve: 62.667 (2)
*/